### Import the necessary library

In [1]:
import numpy as np
import pandas as pd

### Load the dataset

In [2]:
df = pd.read_csv('amazon.csv', encoding='latin-1')

### 1. Display Top 5 Rows of The Dataset

In [3]:
df.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

### 2. Check Last 5 Rows

In [4]:
df.tail()

      year      state     month  number        date
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

### 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [5]:
print("Shape of the Dataset", df.shape)
print("Number of rows", df.shape[0])
print("Number of columns", df.shape[1])

Shape of the Dataset (6454, 5)
Number of rows 6454
Number of columns 5

### 4. Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

### 5. Check For Duplicate Data and Drop Them

In [7]:
df.duplicated().sum()

32

In [8]:
df = df.drop_duplicates()

In [9]:
df.duplicated().sum()

0

### 6. Check Null Values In The Dataset

In [10]:
df.isnull().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

### 7. Get Overall Statistics About The Dataframe

In [11]:
df.describe()

              year       number
count  6422.000000  6422.000000
mean   2007.490969   108.815178
std       5.731806   191.142482
min    1998.000000     0.000000
25%    2003.000000     3.000000
50%    2007.000000    24.497000
75%    2012.000000   114.000000
max    2017.000000   998.000000

In [12]:
# for all the columns
df.describe(include='all')

               year state   month       number        date
count   6422.000000  6422    6422  6422.000000        6422
unique          NaN    23      12          NaN          20
top             NaN   Rio  Agosto          NaN  2015-01-01
freq            NaN   697     540          NaN         324
mean    2007.490969   NaN     NaN   108.815178         NaN
std        5.731806   NaN     NaN   191.142482         NaN
min     1998.000000   NaN     NaN     0.000000         NaN
25%     2003.000000   NaN     NaN     3.000000         NaN
50%     2007.000000   NaN     NaN    24.497000         NaN
75%     2012.000000   NaN     NaN   114.000000         NaN
max     2017.000000   NaN     NaN   998.000000         NaN

### 8. Rename Month Names To English

In [13]:
df.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

In [14]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

### 9. Total Number of Fires Registered

In [15]:
len(df)

6422

### 10. In Which Month Maximum Number of Forest Fires Were Reported?

In [21]:
df['month'].value_counts()

Agosto       540
Setembro     540
Outubro      540
Novembro     540
Junho        539
Julho        539
Janeiro      535
Fevereiro    535
Março        534
Abril        534
Maio         533
Dezembro     513
Name: month, dtype: int64

In [22]:
df['month'].value_counts().head(4)

Agosto      540
Setembro    540
Outubro     540
Novembro    540
Name: month, dtype: int64

### 11. In Which Year Maximum Number of Forest Fires Was Reported?

In [24]:
df['year'].value_counts()

2015    324
2010    324
2000    324
2014    324
2002    324
2003    324
2005    324
2012    324
2016    324
1999    324
2011    324
2013    323
2008    323
2009    323
2006    323
2004    323
2007    322
2001    321
1998    304
2017    296
Name: year, dtype: int64

In [25]:
df['year'].value_counts().head(11)

2015    324
2010    324
2000    324
2014    324
2002    324
2003    324
2005    324
2012    324
2016    324
1999    324
2011    324
Name: year, dtype: int64

### 12. In Which State Maximum Number of Forest Fires Was Reported?

In [28]:
df['state'].value_counts()

Rio                 697
Mato Grosso         473
Paraiba             472
Acre                239
Pará                239
Sergipe             239
Sao Paulo           239
Santa Catarina      239
Roraima             239
Rondonia            239
Piau                239
Pernambuco          239
Minas Gerais        239
Alagoas             239
Maranhao            239
Goias               239
Espirito Santo      239
Distrito Federal    239
Ceara               239
Bahia               239
Amazonas            239
Amapa               239
Tocantins           239
Name: state, dtype: int64

In [30]:
df['state'].value_counts().head(1)

Rio    697
Name: state, dtype: int64

### 13. Find Total Number of Fires Were Reported In Amazonas

In [32]:
len(df[df['state'] == 'Amazonas'])

239

### 14. Display Number of Fires Were Reported In Amazonas (Year-Wise)

### 15. Display Number of Fires Were Reported In Amazonas (Day-Wise)

### 16. Find Total Number of Fires  Were Reported In 2015 And Visualize Data Based on Each ‘Month’

### 17. Find Average Number of Fires Were Reported From Highest to Lowest (State-Wise)

### 18.  To Find The State Names Where Fires Were Reported In 'dec' Month